Tekla Open API Reference for Tekla Structures 2025
ModelAccess Class
 The ModelAccess class contains helper methods for connecting to and accessing the model and objects in the model. The class attempts to provide efficient but robust methods for connecting to and verifying the connection to the model.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Dialog.UIControls.ModelAccess
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class ModelAccess
Public Class ModelAccess
The ModelAccess type exposes the following members.
Constructors
Name | Description
ModelAccess
Initializes a new instance of the ModelAccess class
Top
Methods
Name | Description
ConnectToModel()
 Gets a model connnection.
ConnectToModel(Boolean)
 Gets a model connection.
ConnectToModel(Model)
 Gets a model connection.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace